---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.VelocityPressure
source: html/116033d9-b0dd-13e4-d22f-80f5b9f90e15.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.VelocityPressure Property

The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ft·s²)).

## Syntax (C#)
```csharp
public double VelocityPressure { get; }
```